{"pageContent":"Thermalright Peerless Assassin 120 SE: a high-performance dual-tower air cooler known for its exceptional cooling power and silent operation. The Peerless Assassin 120 SE is a perfect balance of performance and value, making it an excellent choice for any build from mid-range to high-end. Specs: Manufacturer: Thermalright, Fan RPM: 1550 RPM (MAX), Noise Level: 25.6 dBA, Height: 155 mm, CPU Socket: LGA1700, LGA1200, LGA115X, AM5, AM4, Color: Black / Silver, Heatpipes: 6 x 6mm.","metadata":{"title":"Thermalright Peerless Assassin 120 SE","product_id":"COOLER-001","description":"A high-performance dual-tower air cooler known for its exceptional cooling power and silent operation. The Peerless Assassin 120 SE is a perfect balance of performance and value, making it an excellent choice for any build from mid-range to high-end.","price":"29.99 JOD","thumbnail":"https://m.media-amazon.com/images/I/71B9-KqX1iL._AC_SL1500_.jpg","warranty":"3-Year Thermalright Warranty","specs":{"model":"Peerless Assassin 120 SE","manufacturer":"Thermalright","fan_rpm":"1550 RPM (MAX)","noise_level":"25.6 dBA","height":"155 mm","cpu_socket":"LGA1700, LGA1200, LGA115X, AM5, AM4","color":"Black / Silver","heatpipes":"6 x 6mm"}}}
{"pageContent":"ARCTIC Liquid Freezer III Pro 360: a cutting-edge AIO liquid cooler designed for enthusiasts and overclockers. With its innovative VRM fan and robust 360mm radiator, it offers superior cooling performance and a 6-year warranty, ensuring long-term reliability for your high-performance CPU. Specs: Manufacturer: ARCTIC, Radiator Size: 360 mm, Fan RPM: 600-3000 RPM, Noise Level: N/A, CPU Socket: LGA1851, LGA1700, AM5, AM4, Radiator Material: Aluminum.","metadata":{"title":"ARCTIC Liquid Freezer III Pro 360","product_id":"COOLER-002","description":"The ARCTIC Liquid Freezer III Pro 360 is a cutting-edge AIO liquid cooler designed for enthusiasts and overclockers. With its innovative VRM fan and robust 360mm radiator, it offers superior cooling performance and a 6-year warranty, ensuring long-term reliability for your high-performance CPU.","price":"129.99 JOD","thumbnail":"https://m.media-amazon.com/images/I/71B-c8GzYKL._AC_SL1500_.jpg","warranty":"6-Year Manufacturer's Warranty","specs":{"model":"Liquid Freezer III Pro 360","manufacturer":"ARCTIC","radiator_size":"360 mm","fan_rpm":"600-3000 RPM","noise_level":"N/A","cpu_socket":"LGA1851, LGA1700, AM5, AM4","radiator_material":"Aluminum"}}}
{"pageContent":"Cooler Master Hyper 212 Black Edition: an iconic air cooler that continues to be a favorite among PC builders. The Hyper 212 Black Edition offers excellent cooling for a wide range of CPUs, a sleek black finish, and a reliable design at an affordable price, making it a great choice for budget-conscious customers. Specs: Manufacturer: Cooler Master, Fan RPM: 650-2000 RPM, Noise Level: 8-30 dBA, Height: 158.8 mm, CPU Socket: LGA2066, LGA2011-v3, LGA1700, LGA1200, LGA115X, AM5, AM4, Heatpipes: 4 Direct Contact.","metadata":{"title":"Cooler Master Hyper 212 Black Edition","product_id":"COOLER-003","description":"An iconic air cooler that continues to be a favorite among PC builders. The Hyper 212 Black Edition offers excellent cooling for a wide range of CPUs, a sleek black finish, and a reliable design at an affordable price, making it a great choice for budget-conscious customers.","price":"19.99 JOD","thumbnail":"https://m.media-amazon.com/images/I/61N+VwQ7nIL._AC_SL1500_.jpg","warranty":"2-Year Manufacturer's Warranty","specs":{"model":"Hyper 212 Black Edition","manufacturer":"Cooler Master","fan_rpm":"650-2000 RPM","noise_level":"8-30 dBA","height":"158.8 mm","cpu_socket":"LGA2066, LGA2011-v3, LGA1700, LGA1200, LGA115X, AM5, AM4","heatpipes":"4 Direct Contact"}}}
{"pageContent":"Thermalright Aqua Elite V3: a stylish and efficient 360mm AIO liquid cooler that provides a great cooling solution for modern processors. The Aqua Elite V3 comes with ARGB fans and a pump head to add a vibrant look to your build, all at a very competitive price. Specs: Manufacturer: Thermalright, Radiator Size: 360 mm, Fan RPM: 1500 RPM (MAX), Noise Level: 25.6 dBA, CPU Socket: LGA1700, LGA1200, LGA115X, AM5, AM4.","metadata":{"title":"Thermalright Aqua Elite V3","product_id":"COOLER-004","description":"A stylish and efficient 360mm AIO liquid cooler that provides a great cooling solution for modern processors. The Aqua Elite V3 comes with ARGB fans and a pump head to add a vibrant look to your build, all at a very competitive price.","price":"39.99 JOD","thumbnail":"https://m.media-amazon.com/images/I/71u9s8XoJvL._AC_SL1500_.jpg","warranty":"3-Year Thermalright Warranty","specs":{"model":"Aqua Elite V3","manufacturer":"Thermalright","radiator_size":"360 mm","fan_rpm":"1500 RPM (MAX)","noise_level":"25.6 dBA","cpu_socket":"LGA1700, LGA1200, LGA115X, AM5, AM4"}}}
{"pageContent":"Thermalright Phantom Spirit 120 SE ARGB: a fantastic dual-tower air cooler with customizable ARGB lighting, offering top-tier performance to rival more expensive coolers. Its dual-fan setup ensures excellent heat dissipation for demanding CPUs, making it a great value for performance enthusiasts. Specs: Manufacturer: Thermalright, Fan RPM: 1500 RPM (MAX), Noise Level: 25.6 dBA, Height: 154 mm, CPU Socket: LGA1700, LGA1200, LGA115X, AM5, AM4, Color: Black / ARGB, Heatpipes: 6 x 6mm.","metadata":{"title":"Thermalright Phantom Spirit 120 SE ARGB","product_id":"COOLER-005","description":"The Phantom Spirit 120 SE ARGB is a fantastic dual-tower air cooler with customizable ARGB lighting, offering top-tier performance to rival more expensive coolers. Its dual-fan setup ensures excellent heat dissipation for demanding CPUs, making it a great value for performance enthusiasts.","price":"29.99 JOD","thumbnail":"https://m.media-amazon.com/images/I/71rJ4T1k2nL._AC_SL1500_.jpg","warranty":"3-Year Thermalright Warranty","specs":{"model":"Phantom Spirit 120 SE ARGB","manufacturer":"Thermalright","fan_rpm":"1500 RPM (MAX)","noise_level":"25.6 dBA","height":"154 mm","cpu_socket":"LGA1700, LGA1200, LGA115X, AM5, AM4","color":"Black / ARGB","heatpipes":"6 x 6mm"}}}
{"pageContent":"Corsair NAUTILUS 360 RS ARGB: a premium 360mm AIO liquid cooler from a trusted brand. The NAUTILUS 360 RS ARGB combines high-performance cooling with vibrant ARGB lighting and a clean, modern aesthetic. The easy daisy-chaining of fans simplifies installation and cable management. Specs: Manufacturer: Corsair, Radiator Size: 360 mm, Fan RPM: 0-2100 RPM, Noise Level: 10-36 dBA, CPU Socket: LGA1851, LGA1700, AM5, AM4.","metadata":{"title":"Corsair NAUTILUS 360 RS ARGB","product_id":"COOLER-006","description":"A premium 360mm AIO liquid cooler from a trusted brand. The NAUTILUS 360 RS ARGB combines high-performance cooling with vibrant ARGB lighting and a clean, modern aesthetic. The easy daisy-chaining of fans simplifies installation and cable management.","price":"79.99 JOD","thumbnail":"https://m.media-amazon.com/images/I/71+vC4sXfML._AC_SL1500_.jpg","warranty":"2-Year Limited Warranty","specs":{"model":"NAUTILUS 360 RS ARGB","manufacturer":"Corsair","radiator_size":"360 mm","fan_rpm":"0-2100 RPM","noise_level":"10-36 dBA","cpu_socket":"LGA1851, LGA1700, AM5, AM4"}}}
{"pageContent":"Noctua NH-D15 chromax.black: the legendary NH-D15 in a sleek, all-black design. The NH-D15 chromax.black is a top-of-the-line air cooler that provides cooling performance comparable to many AIO liquid coolers, all while maintaining near-silent operation. It's the ultimate choice for silence and performance. Specs: Manufacturer: Noctua, Fan RPM: 1500 RPM (MAX), Noise Level: 24.6 dBA, Height: 165 mm, CPU Socket: LGA1700, LGA1200, LGA115X, AM5, AM4.","metadata":{"title":"Noctua NH-D15 chromax.black","product_id":"COOLER-007","description":"The legendary NH-D15 in a sleek, all-black design. The NH-D15 chromax.black is a top-of-the-line air cooler that provides cooling performance comparable to many AIO liquid coolers, all while maintaining near-silent operation. It's the ultimate choice for silence and performance.","price":"79.99 JOD","thumbnail":"https://m.media-amazon.com/images/I/81xUe5-rSBL._AC_SL1500_.jpg","warranty":"6-Year Manufacturer's Warranty","specs":{"model":"NH-D15 chromax.black","manufacturer":"Noctua","fan_rpm":"1500 RPM (MAX)","noise_level":"24.6 dBA","height":"165 mm","cpu_socket":"LGA1700, LGA1200, LGA115X, AM5, AM4"}}}
{"pageContent":"NZXT Kraken 360 RGB: a premium AIO liquid cooler with a stunning design and excellent performance. The Kraken 360 RGB features a bright LCD display on the pump head for displaying system information or custom GIFs, making it a centerpiece for any high-end PC build. Specs: Manufacturer: NZXT, Radiator Size: 360 mm, Fan RPM: 500-1800 RPM, Noise Level: 33.88 dBA, CPU Socket: LGA1700, LGA1200, LGA115X, AM5, AM4.","metadata":{"title":"NZXT Kraken 360 RGB","product_id":"COOLER-008","description":"A premium AIO liquid cooler with a stunning design and excellent performance. The Kraken 360 RGB features a bright LCD display on the pump head for displaying system information or custom GIFs, making it a centerpiece for any high-end PC build.","price":"109.99 JOD","thumbnail":"https://m.media-amazon.com/images/I/71r4q-X+v6L._AC_SL1500_.jpg","warranty":"6-Year Manufacturer's Warranty","specs":{"model":"Kraken 360 RGB","manufacturer":"NZXT","radiator_size":"360 mm","fan_rpm":"500-1800 RPM","noise_level":"33.88 dBA","cpu_socket":"LGA1700, LGA1200, LGA115X, AM5, AM4"}}}
{"pageContent":"Thermalright Assassin X 120 Refined SE ARGB: an excellent entry-level CPU air cooler that offers impressive performance for its price. The Assassin X 120 Refined SE ARGB comes with a quiet ARGB fan and a compact design, making it a perfect upgrade from a stock cooler for budget builds. Specs: Manufacturer: Thermalright, Fan RPM: 1550 RPM (MAX), Noise Level: 25.6 dBA, Height: 154 mm, CPU Socket: LGA1700, LGA1200, LGA115X, AM5, AM4.","metadata":{"title":"Thermalright Assassin X 120 Refined SE ARGB","product_id":"COOLER-009","description":"An excellent entry-level CPU air cooler that offers impressive performance for its price. The Assassin X 120 Refined SE ARGB comes with a quiet ARGB fan and a compact design, making it a perfect upgrade from a stock cooler for budget builds.","price":"9.99 JOD","thumbnail":"https://m.media-amazon.com/images/I/71wK8WnS6VL._AC_SL1500_.jpg","warranty":"3-Year Thermalright Warranty","specs":{"model":"Assassin X 120 Refined SE ARGB","manufacturer":"Thermalright","fan_rpm":"1550 RPM (MAX)","noise_level":"25.6 dBA","height":"154 mm","cpu_socket":"LGA1700, LGA1200, LGA115X, AM5, AM4"}}}
{"pageContent":"Thermalright Phantom Spirit 120 SE: the non-RGB version of the Phantom Spirit, this cooler is all about pure performance. Its dual-tower design and high-efficiency fans deliver outstanding thermal performance, making it one of the best value-for-money air coolers on the market for those who prefer a stealthy, non-RGB look. Specs: Manufacturer: Thermalright, Fan RPM: 1500 RPM (MAX), Noise Level: 25.6 dBA, Height: 154 mm, CPU Socket: LGA1851, LGA1700, LGA1200, LGA115X, AM5, AM4.","metadata":{"title":"Thermalright Phantom Spirit 120 SE","product_id":"COOLER-010","description":"The non-RGB version of the Phantom Spirit, this cooler is all about pure performance. Its dual-tower design and high-efficiency fans deliver outstanding thermal performance, making it one of the best value-for-money air coolers on the market for those who prefer a stealthy, non-RGB look.","price":"29.99 JOD","thumbnail":"https://m.media-amazon.com/images/I/71L5-oN1t4L._AC_SL1500_.jpg","warranty":"3-Year Thermalright Warranty","specs":{"model":"Phantom Spirit 120 SE","manufacturer":"Thermalright","fan_rpm":"1500 RPM (MAX)","noise_level":"25.6 dBA","height":"154 mm","cpu_socket":"LGA1851, LGA1700, LGA1200, LGA115X, AM5, AM4"}}}
{"pageContent":"ARCTIC Freezer 36 A-RGB: a versatile and effective tower air cooler with dual A-RGB fans. The Freezer 36 offers a great balance between cooling performance, quiet operation, and aesthetics. Its innovative fan mounting system makes installation a breeze. Specs: Manufacturer: ARCTIC, Fan RPM: 200-2000 RPM, Noise Level: N/A, Height: 159 mm, CPU Socket: LGA1851, LGA1700, AM5, AM4.","metadata":{"title":"ARCTIC Freezer 36 A-RGB","product_id":"COOLER-011","description":"A versatile and effective tower air cooler with dual A-RGB fans. The Freezer 36 offers a great balance between cooling performance, quiet operation, and aesthetics. Its innovative fan mounting system makes installation a breeze.","price":"39.99 JOD","thumbnail":"https://m.media-amazon.com/images/I/61N+VwQ7nIL._AC_SL1500_.jpg","warranty":"6-Year Manufacturer's Warranty","specs":{"model":"Freezer 36 A-RGB","manufacturer":"ARCTIC","fan_rpm":"200-2000 RPM","noise_level":"N/A","height":"159 mm","cpu_socket":"LGA1851, LGA1700, AM5, AM4"}}}
{"pageContent":"NZXT Kraken 240: a sleek 240mm AIO liquid cooler with a vibrant LCD display. The Kraken 240 offers reliable cooling for mid-range CPUs and provides a high-end visual flair with its customizable screen. It's a great choice for builders who want both performance and aesthetics. Specs: Manufacturer: NZXT, Radiator Size: 240 mm, Fan RPM: 500-1800 RPM, Noise Level: 33.88 dBA, CPU Socket: LGA1700, LGA1200, LGA115X, AM5, AM4.","metadata":{"title":"NZXT Kraken 240","product_id":"COOLER-012","description":"A sleek 240mm AIO liquid cooler with a vibrant LCD display. The Kraken 240 offers reliable cooling for mid-range CPUs and provides a high-end visual flair with its customizable screen. It's a great choice for builders who want both performance and aesthetics.","price":"79.99 JOD","thumbnail":"https://m.media-amazon.com/images/I/71LgU3s8SLL._AC_SL1500_.jpg","warranty":"6-Year Manufacturer's Warranty","specs":{"model":"Kraken 240","manufacturer":"NZXT","radiator_size":"240 mm","fan_rpm":"500-1800 RPM","noise_level":"33.88 dBA","cpu_socket":"LGA1700, LGA1200, LGA115X, AM5, AM4"}}}
{"pageContent":"be quiet! Dark Rock Pro 5: a flagship air cooler known for its excellent performance and incredibly quiet operation. With its massive dual-tower heatsink and two Silent Wings fans, it can handle even the most demanding CPUs with ease, all in a sleek black design. Specs: Manufacturer: be quiet!, Fan RPM: 2000 RPM (MAX), Noise Level: 23.3 dBA, Height: 168 mm, CPU Socket: LGA1700, LGA1200, LGA115X, AM5, AM4.","metadata":{"title":"be quiet! Dark Rock Pro 5","product_id":"COOLER-013","description":"The Dark Rock Pro 5 is a flagship air cooler known for its excellent performance and incredibly quiet operation. With its massive dual-tower heatsink and two Silent Wings fans, it can handle even the most demanding CPUs with ease, all in a sleek black design.","price":"79.99 JOD","thumbnail":"https://m.media-amazon.com/images/I/71nO4p4Q+KL._AC_SL1500_.jpg","warranty":"3-Year Manufacturer's Warranty","specs":{"model":"Dark Rock Pro 5","manufacturer":"be quiet!","fan_rpm":"2000 RPM (MAX)","noise_level":"23.3 dBA","height":"168 mm","cpu_socket":"LGA1700, LGA1200, LGA115X, AM5, AM4"}}}
{"pageContent":"Asus ROG STRIX LC 360 RGB GUNDAM: a collaboration with the Gundam franchise, this is a unique AIO liquid cooler for enthusiasts and collectors. The ROG STRIX LC 360 RGB GUNDAM features powerful cooling, addressable RGB fans, and an iconic design that is a must-have for any Gundam-themed build. Specs: Manufacturer: Asus ROG, Radiator Size: 360 mm, Fan RPM: N/A, Noise Level: N/A, CPU Socket: LGA1700, LGA1200, LGA115X, LGA2066, AM4, TR4.","metadata":{"title":"Asus ROG STRIX LC 360 RGB GUNDAM","product_id":"COOLER-014","description":"A collaboration with the Gundam franchise, this is a unique AIO liquid cooler for enthusiasts and collectors. The ROG STRIX LC 360 RGB GUNDAM features powerful cooling, addressable RGB fans, and an iconic design that is a must-have for any Gundam-themed build.","price":"139.99 JOD","thumbnail":"https://m.media-amazon.com/images/I/71+vC4sXfML._AC_SL1500_.jpg","warranty":"3-Year Manufacturer's Warranty","specs":{"model":"ROG STRIX LC 360 RGB GUNDAM","manufacturer":"Asus ROG","radiator_size":"360 mm","fan_rpm":"N/A","noise_level":"N/A","cpu_socket":"LGA1700, LGA1200, LGA115X, LGA2066, AM4, TR4"}}}
{"pageContent":"Cooler Master MasterLiquid 360L Core ARGB: a budget-friendly 360mm AIO liquid cooler that delivers solid performance and features vibrant ARGB lighting. It's an excellent entry point into liquid cooling for a triple fan setup without breaking the bank. Specs: Manufacturer: Cooler Master, Radiator Size: 360 mm, Fan RPM: 650-1750 RPM, Noise Level: 27.2 dBA (MAX), CPU Socket: LGA1700, LGA1200, LGA115X, AM5, AM4.","metadata":{"title":"Cooler Master MasterLiquid 360L Core ARGB","product_id":"COOLER-015","description":"The MasterLiquid 360L Core ARGB is a budget-friendly 360mm AIO liquid cooler that delivers solid performance and features vibrant ARGB lighting. It's an excellent entry point into liquid cooling for a triple fan setup without breaking the bank.","price":"69.99 JOD","thumbnail":"https://m.media-amazon.com/images/I/71XyYf9eCFL._AC_SL1500_.jpg","warranty":"3-Year Manufacturer's Warranty","specs":{"model":"MasterLiquid 360L Core ARGB","manufacturer":"Cooler Master","radiator_size":"360 mm","fan_rpm":"650-1750 RPM","noise_level":"27.2 dBA (MAX)","cpu_socket":"LGA1700, LGA1200, LGA115X, AM5, AM4"}}}
{"pageContent":"ID-COOLING SE-214-XT ARGB: an affordable and compact air cooler that punches above its weight. The SE-214-XT ARGB features four direct-touch heatpipes and a 120mm ARGB fan, providing excellent cooling performance for entry-level and mid-range CPUs. Specs: Manufacturer: ID-COOLING, Fan RPM: 500-1500 RPM, Noise Level: 26.6 dBA (MAX), Height: 150 mm, CPU Socket: LGA1700, LGA1200, LGA115X, AM5, AM4.","metadata":{"title":"ID-COOLING SE-214-XT ARGB","product_id":"COOLER-016","description":"An affordable and compact air cooler that punches above its weight. The SE-214-XT ARGB features four direct-touch heatpipes and a 120mm ARGB fan, providing excellent cooling performance for entry-level and mid-range CPUs.","price":"19.99 JOD","thumbnail":"https://m.media-amazon.com/images/I/7178W77u-1L._AC_SL1500_.jpg","warranty":"3-Year Manufacturer's Warranty","specs":{"model":"SE-214-XT ARGB","manufacturer":"ID-COOLING","fan_rpm":"500-1500 RPM","noise_level":"26.6 dBA (MAX)","height":"150 mm","cpu_socket":"LGA1700, LGA1200, LGA115X, AM5, AM4"}}}
{"pageContent":"AMD Wraith Prism: the stock cooler for high-end AMD CPUs, the Wraith Prism is a solid and reliable air cooler that includes customizable RGB lighting. It is a good option for those who want a capable cooler without the need for an aftermarket solution. Specs: Manufacturer: AMD, Fan RPM: N/A, Noise Level: N/A, CPU Socket: AM4.","metadata":{"title":"AMD Wraith Prism","product_id":"COOLER-017","description":"The stock cooler for high-end AMD CPUs, the Wraith Prism is a solid and reliable air cooler that includes customizable RGB lighting. It is a good option for those who want a capable cooler without the need for an aftermarket solution.","price":"9.99 JOD","thumbnail":"https://m.media-amazon.com/images/I/81d5r8c1QFL._AC_SL1500_.jpg","warranty":"N/A (Included with CPU)","specs":{"model":"Wraith Prism","manufacturer":"AMD","fan_rpm":"N/A","noise_level":"N/A","cpu_socket":"AM4"}}}
{"pageContent":"Thermalright Phantom Spirit EVO: an upgraded version of the popular Phantom Spirit series, featuring improved fans and a more refined design for even better thermal performance. This cooler is a powerhouse that can handle the most powerful CPUs on the market. Specs: Manufacturer: Thermalright, Fan RPM: 2150 RPM (MAX), Noise Level: 27 dBA, Height: 157 mm, CPU Socket: LGA1851, LGA1700, LGA1200, LGA115X, LGA2011, LGA2066, AM5, AM4.","metadata":{"title":"Thermalright Phantom Spirit EVO","product_id":"COOLER-018","description":"The Phantom Spirit EVO is an upgraded version of the popular Phantom Spirit series, featuring improved fans and a more refined design for even better thermal performance. This cooler is a powerhouse that can handle the most powerful CPUs on the market.","price":"39.99 JOD","thumbnail":"https://m.media-amazon.com/images/I/71g6z8tW7JL._AC_SL1500_.jpg","warranty":"3-Year Thermalright Warranty","specs":{"model":"Phantom Spirit EVO","manufacturer":"Thermalright","fan_rpm":"2150 RPM (MAX)","noise_level":"27 dBA","height":"157 mm","cpu_socket":"LGA1851, LGA1700, LGA1200, LGA115X, LGA2011, LGA2066, AM5, AM4"}}}
{"pageContent":"Thermalright Peerless Assassin 120 SE WHITE ARGB: a stylish and powerful dual-tower air cooler in an all-white design with ARGB fans. The Peerless Assassin 120 SE WHITE ARGB offers the same great performance as its black counterpart but with a clean, modern aesthetic perfect for white-themed builds. Specs: Manufacturer: Thermalright, Fan RPM: 1550 RPM (MAX), Noise Level: 25.6 dBA, Height: 155 mm, CPU Socket: LGA1851, LGA1700, LGA1200, LGA115X, AM5, AM4.","metadata":{"title":"Thermalright Peerless Assassin 120 SE WHITE ARGB","product_id":"COOLER-019","description":"A stylish and powerful dual-tower air cooler in an all-white design with ARGB fans. The Peerless Assassin 120 SE WHITE ARGB offers the same great performance as its black counterpart but with a clean, modern aesthetic perfect for white-themed builds.","price":"29.99 JOD","thumbnail":"https://m.media-amazon.com/images/I/71g+Q6pQvKL._AC_SL1500_.jpg","warranty":"3-Year Thermalright Warranty","specs":{"model":"Peerless Assassin 120 SE WHITE ARGB","manufacturer":"Thermalright","fan_rpm":"1550 RPM (MAX)","noise_level":"25.6 dBA","height":"155 mm","cpu_socket":"LGA1851, LGA1700, LGA1200, LGA115X, AM5, AM4"}}}
{"pageContent":"ID-COOLING SE-903-XT: a small yet effective air cooler for compact builds and low-power CPUs. The SE-903-XT features a 92mm fan and a compact design, making it an ideal choice for SFF (Small Form Factor) cases and budget-oriented systems where space is a concern. Specs: Manufacturer: ID-COOLING, Fan RPM: 500-2200 RPM, Noise Level: 25.8 dBA (MAX), Height: 123 mm, CPU Socket: LGA1851, LGA1700, LGA1200, LGA115X, AM5, AM4.","metadata":{"title":"ID-COOLING SE-903-XT","product_id":"COOLER-020","description":"A small yet effective air cooler for compact builds and low-power CPUs. The SE-903-XT features a 92mm fan and a compact design, making it an ideal choice for SFF (Small Form Factor) cases and budget-oriented systems where space is a concern.","price":"9.99 JOD","thumbnail":"https://m.media-amazon.com/images/I/61k4d2tG5TL._AC_SL1500_.jpg","warranty":"3-Year Manufacturer's Warranty","specs":{"model":"SE-903-XT","manufacturer":"ID-COOLING","fan_rpm":"500-2200 RPM","noise_level":"25.8 dBA (MAX)","height":"123 mm","cpu_socket":"LGA1851, LGA1700, LGA1200, LGA115X, AM5, AM4"}}}