{"pageContent":"A high-end motherboard for the latest Intel processors, featuring an extended heatsink, Wi-Fi 7, and a robust power design. It is perfect for gamers and power users who need a stable and high-performance platform. With a 16+1+1+1 Duet Rail Power System and 90A SPS, it is built to handle heavy loads with ease. The board also includes multiple M.2 slots for lightning-fast storage.","metadata":{"title":"MSI MAG Z890 TOMAHAWK WIFI","description":"Designed for a stable, durable, and DIY-friendly foundation for PC builds, the MAG Z890 TOMAHAWK WIFI comes with Wi-Fi 7 and 5G LAN for flawless connectivity. It also features a one-click overclocking solution and an optimized UI/UX design. The 16+1+1+1 Duet Rail Power System with 90A SPS ensures stable power delivery. This is a great choice for high-end builds.","price":"199.99 JOD","thumbnail":"https://www.msi.com/Motherboard/MAG-Z890-TOMAHAWK-WIFI","product_id":"MOBO-001","specs":{"Manufacturer":"MSI","Series":"MAG","Chipset":"Intel Z890","Socket":"LGA1851","Form Factor":"ATX","Memory":"DDR5","M.2 Slots":"4","Wi-Fi":"Wi-Fi 7","LAN":"5G LAN","Power Stages":"16+1+1+1 Duet Rail 90A SPS"}}}
{"pageContent":"This motherboard is a solid foundation for Intel's latest processors, offering a robust power design, high-speed connectivity, and an advanced cooling system. It is packed with features for enthusiasts and gamers alike. The board supports DDR5 memory and includes multiple PCIe 5.0 and 4.0 slots for both graphics cards and M.2 SSDs. Its thermal design ensures stable performance even under heavy loads.","metadata":{"title":"Gigabyte Z890 EAGLE WIFI7","description":"The Gigabyte Z890 EAGLE WIFI7 is a powerful motherboard for Intel Core Ultra processors. It features a 14+1+2 Twin Digital VRM design with 60A DrMOS and a 2X Copper PCB for superior performance. The board has 4 M.2 slots (1 PCIe 5.0, 3 PCIe 4.0), a PCIe 5.0 x16 slot with EZ-Latch Plus, and Wi-Fi 7 for fast wireless speeds. It is an excellent choice for a high-performance build.","price":"179.99 JOD","thumbnail":"https://www.gigabyte.com/Motherboard/Z890-EAGLE-WIFI7","product_id":"MOBO-002","specs":{"Manufacturer":"Gigabyte","Series":"EAGLE","Chipset":"Intel Z890","Socket":"LGA1851","Form Factor":"ATX","Memory":"DDR5","M.2 Slots":"4","Wi-Fi":"Wi-Fi 7","LAN":"2.5G LAN","Power Stages":"14+1+2 Twin Digital VRM 60A DrMOS"}}}
{"pageContent":"A high-performance motherboard for Intel 13th and 14th Gen Core processors, the MSI MAG Z790 TOMAHAWK MAX WIFI is built for gamers. It features a robust 16-phase mirrored power arrangement, Wi-Fi 7, and 2.5G LAN. The extended heatsink and M.2 Shield Frozr ensure stable operation even under extreme conditions. With Lightning Gen 5 support, it is ready for next-gen hardware.","metadata":{"title":"MSI MAG Z790 TOMAHAWK MAX WIFI","description":"The MSI MAG Z790 TOMAHAWK MAX WIFI is a gaming motherboard that provides a stable, solid, and durable foundation for your PC build. It features a 16-phase mirrored power arrangement with 90A SPS, an extended heatsink, and M.2 Shield Frozr for premium cooling. It also includes Wi-Fi 7 and 2.5G LAN for superior connectivity.","price":"199.99 JOD","thumbnail":"https://www.msi.com/Motherboard/MAG-Z790-TOMAHAWK-MAX-WIFI","product_id":"MOBO-003","specs":{"Manufacturer":"MSI","Series":"MAG","Chipset":"Intel Z790","Socket":"LGA1700","Form Factor":"ATX","Memory":"DDR5","M.2 Slots":"4","Wi-Fi":"Wi-Fi 7","LAN":"2.5G LAN","Power Stages":"16-phase Mirrored 90A SPS"}}}
{"pageContent":"This is a budget-friendly motherboard that doesn't compromise on features. It supports Intel 12th, 13th, and 14th Gen processors and is equipped with DDR4 memory support, making it a great choice for a new build on a tight budget. It has a comprehensive cooling system and multiple fan headers, ensuring reliable performance.","metadata":{"title":"Gigabyte B760M DS3H DDR4","description":"The Gigabyte B760M DS3H DDR4 is a compact, micro-ATX motherboard that provides a great balance of features and affordability. It's built with a 6+2+1 Phases Hybrid VRM Design, PCIe 5.0 ready PCB, and supports DDR4 memory. With two M.2 slots, multiple fan headers, and Q-FLASH PLUS for easy BIOS updates, it’s perfect for a budget-conscious build.","price":"69.99 JOD","thumbnail":"https://www.gigabyte.com/Motherboard/B760M-DS3H-DDR4-GEN5","product_id":"MOBO-004","specs":{"Manufacturer":"Gigabyte","Series":"DS3H","Chipset":"Intel B760","Socket":"LGA1700","Form Factor":"Micro ATX","Memory":"DDR4","M.2 Slots":"2","VRM":"6+2+1 Phases Hybrid VRM"}}}
{"pageContent":"A durable and feature-rich motherboard for Intel 12th and 13th Gen processors. It features a robust power phase design and DDR5 support with XMP profiles for easy overclocking. The reinforced steel slot for PCIe 5.0 ensures durability, while the Wi-Fi 6E and Dragon 2.5Gb/s LAN provide fast networking.","metadata":{"title":"ASRock B760M Steel Legend WiFi","description":"The ASRock B760M Steel Legend WiFi offers a strong array of materials and components for stable and reliable performance. It features a 12+1+1 power phase design, 6-layer PCB with 2oz Copper, and a PCIe 5.0 slot for future-proof performance. The Wi-Fi 6E and 2.5G LAN offer excellent networking, and its Polychrome RGB allows for a customizable look. This board is a great mid-range option.","price":"89.99 JOD","thumbnail":"https://www.asrock.com/mb/Intel/B760M%20Steel%20Legend%20WiFi/index.us.asp","product_id":"MOBO-005","specs":{"Manufacturer":"ASRock","Series":"Steel Legend","Chipset":"Intel B760","Socket":"LGA1700","Form Factor":"Micro ATX","Memory":"DDR5","M.2 Slots":"2","Wi-Fi":"Wi-Fi 6E","LAN":"2.5G LAN","Power Phases":"12+1+1"}}}
{"pageContent":"This is a basic, entry-level motherboard perfect for a simple, no-frills office or home PC build. It is compatible with Intel's 12th Gen processors and features DDR4 support. While it lacks some of the premium features of its more expensive counterparts, it provides all the essential functionality for a reliable daily driver.","metadata":{"title":"MSI PRO H610M-G DDR4","description":"The MSI PRO H610M-G DDR4 is a budget-friendly motherboard from the PRO series, designed for business and everyday use. It offers stable functionality and high-quality assembly with features like Core Boost, Audio Boost, and Lightning Gen 4 PCI-E. It supports both digital and legacy displays with HDMI, DisplayPort, and VGA ports, making it a versatile choice for a basic build.","price":"39.99 JOD","thumbnail":"https://www.msi.com/Motherboard/PRO-H610M-G-DDR4","product_id":"MOBO-006","specs":{"Manufacturer":"MSI","Series":"PRO","Chipset":"Intel H610","Socket":"LGA1700","Form Factor":"Micro ATX","Memory":"DDR4","M.2 Slots":"1","LAN":"Gigabit LAN","Display Ports":"HDMI, DisplayPort, VGA"}}}
{"pageContent":"A powerful and feature-rich motherboard for high-performance builds using Intel's latest processors. It features a robust VRM design and advanced thermal solutions to ensure stability and performance. With DDR5 support, multiple M.2 slots, and Wi-Fi 6E, it's ready for any demanding task. This board is an excellent choice for a mid-to-high-end gaming or workstation PC.","metadata":{"title":"Gigabyte Z790 AORUS ELITE AX","description":"The Gigabyte Z790 AORUS ELITE AX is built for unparalleled performance with a Twin 16+1+2 Hybrid Digital VRM Design and a 6-Layer 2X Copper PCB. It features four PCIe 4.0 M.2 connectors, M.2 Thermal Guard III, and a PCIe 5.0 x16 slot. Wi-Fi 6E and 2.5GbE LAN provide high-speed networking, making this board a fantastic choice for serious PC builders.","price":"169.99 JOD","thumbnail":"https://www.gigabyte.com/Motherboard/Z790-AORUS-ELITE-AX-rev-10","product_id":"MOBO-007","specs":{"Manufacturer":"Gigabyte","Series":"AORUS","Chipset":"Intel Z790","Socket":"LGA1700","Form Factor":"ATX","Memory":"DDR5","M.2 Slots":"4","Wi-Fi":"Wi-Fi 6E","LAN":"2.5GbE","Power Stages":"16+1+2 Hybrid Digital"}}}
{"pageContent":"The ultimate motherboard for AMD's high-end Ryzen processors, designed for creators and enthusiasts who need the best of the best. It features a massive 18+2+1 power phase design, dual PCIe 5.0 x16 slots, and dual PCIe 5.0 M.2 slots. With dual LAN (10GbE and 5GbE) and Wi-Fi 7, this board is built for extreme performance and connectivity.","metadata":{"title":"ASRock X870E Taichi Creator","description":"ASRock's X870 Taichi Creator is a flagship motherboard built for professional creators and power users. It features an 18+2+1 power phase design with 80A SPS for smooth power delivery. It offers dual PCIe 5.0 x16 slots, dual PCIe 5.0 M.2 slots, and a massive cooling solution. With 10GbE and 5GbE LAN, dual USB4 Type-C ports, and Wi-Fi 7, this board provides unmatched performance and connectivity.","price":"309.99 JOD","thumbnail":"https://www.asrock.com/mb/AMD/X870%20Taichi%20Creator/index.asp","product_id":"MOBO-008","specs":{"Manufacturer":"ASRock","Series":"Taichi","Chipset":"AMD X870E","Socket":"AM5","Form Factor":"EATX","Memory":"DDR5","M.2 Slots":"4","Wi-Fi":"Wi-Fi 7","LAN":"10GbE + 5GbE","Power Phases":"18+2+1 80A SPS"}}}
{"pageContent":"This motherboard is a premium option for gamers, featuring a stylish carbon black design and powerful internals. It is built to handle the latest Ryzen processors with ease, thanks to its robust power design and advanced thermal solution. It includes multiple M.2 slots, Wi-Fi 7, and 5G LAN for high-speed performance.","metadata":{"title":"MSI MPG X870E CARBON WIFI","description":"The MSI MPG X870E CARBON WIFI is part of the performance gaming series, engineered for high-end gaming. It features an 18+2+1 phases VRM power design with 110A SPS, an extended heatsink with a heat-pipe, and double-sided M.2 Shield Frozr for superior cooling. With 5G and 2.5G LAN, Lightning USB 40G, and Wi-Fi 7, this board is designed to provide a flawless gaming experience.","price":"299.99 JOD","thumbnail":"https://www.msi.com/Motherboard/MPG-X870E-CARBON-WIFI","product_id":"MOBO-009","specs":{"Manufacturer":"MSI","Series":"MPG","Chipset":"AMD X870E","Socket":"AM5","Form Factor":"ATX","Memory":"DDR5","M.2 Slots":"4","Wi-Fi":"Wi-Fi 7","LAN":"5G LAN + 2.5G LAN","Power Phases":"18+2+1 110A SPS"}}}
{"pageContent":"A reliable and feature-packed motherboard for AMD's Ryzen 9000, 8000, and 7000 series processors. It is designed to simplify PC builds with MSI's EZ technology and offers a robust power solution and high-speed connectivity. It's a great choice for both gamers and creators.","metadata":{"title":"MSI MAG B850 TOMAHAWK MAX WIFI","description":"The MSI MAG B850 TOMAHAWK MAX WIFI is a solid choice for a modern AMD Ryzen build. It features a 14+2+1 power phase design with 80A Smart Power Stage, Mystic Light, and Audio Boost 5. The board also includes EZ M.2 Clip II for easy SSD installation, a Flash BIOS button, and Wi-Fi 7. It offers a balance of performance, features, and ease of use.","price":"179.99 JOD","thumbnail":"https://www.bhphotovideo.com/c/product/1880299-REG/msi_b850tmahawkwifimax_mag_b850_tomahawk_max.html","product_id":"MOBO-010","specs":{"Manufacturer":"MSI","Series":"MAG","Chipset":"AMD B850","Socket":"AM5","Form Factor":"ATX","Memory":"DDR5","M.2 Slots":"4","Wi-Fi":"Wi-Fi 7","LAN":"5GbE","Power Phases":"14+2+1 80A SPS"}}}
{"pageContent":"This motherboard offers a great balance of features and value for an AMD AM5 build. It is equipped with a digital VRM design, advanced thermal solutions, and a PCIe 5.0 slot for next-gen performance. With Wi-Fi 6E and GbE LAN, it provides reliable and fast networking.","metadata":{"title":"Gigabyte B650 EAGLE AX","description":"The Gigabyte B650 EAGLE AX is a durable and reliable motherboard for AMD Ryzen 7000 series processors. It features a 12+2+2 Digital VRM Design, an advanced thermal design with fully covered MOSFET heatsinks, and a PCIe 5.0 x16 slot with EZ-Latch. It also includes three M.2 slots (one PCIe 5.0, two PCIe 4.0), Wi-Fi 6E, and GbE LAN, making it a great choice for a high-performance build on a budget.","price":"109.99 JOD","thumbnail":"https://www.gigabyte.com/Motherboard/B650-EAGLE-AX-rev-10-11","product_id":"MOBO-011","specs":{"Manufacturer":"Gigabyte","Series":"EAGLE","Chipset":"AMD B650","Socket":"AM5","Form Factor":"ATX","Memory":"DDR5","M.2 Slots":"3","Wi-Fi":"Wi-Fi 6E","LAN":"GbE","VRM":"12+2+2 Digital"}}}
{"pageContent":"A micro-ATX motherboard built with military-grade components, ensuring rock-solid and stable performance for marathon gaming. It features an upgraded power solution and a comprehensive cooling system. It's a great choice for a compact yet powerful AMD Ryzen build.","metadata":{"title":"Asus TUF GAMING B650M-PLUS WIFI","description":"The Asus TUF GAMING B650M-PLUS WIFI is engineered for stability and durability. It features a robust power design, comprehensive cooling, and support for faster DDR5 memory. With military-grade components, SafeSlot Core+, TUF LANGuard, and a pre-mounted I/O shield, it's a reliable and easy-to-build motherboard. It's a perfect fit for a powerful mid-range gaming PC.","price":"169.99 JOD","thumbnail":"https://www.asus.com/motherboards-components/motherboards/tuf-gaming/tuf-gaming-b650m-plus/","product_id":"MOBO-012","specs":{"Manufacturer":"Asus","Series":"TUF Gaming","Chipset":"AMD B650","Socket":"AM5","Form Factor":"Micro ATX","Memory":"DDR5","M.2 Slots":"2","Wi-Fi":"Wi-Fi 6","LAN":"2.5GbE"}}}
{"pageContent":"A gaming motherboard that provides a great balance of features and affordability. It supports AMD Ryzen 7000 series processors and features a 5+2+2 Phases Digital VRM Solution. The board also includes high-speed networking with Wi-Fi 802.11ax and 2.5GbE LAN.","metadata":{"title":"Gigabyte B650M GAMING X WIFI6E","description":"The Gigabyte B650M GAMING X WIFI6E is a compact gaming motherboard with a solid feature set. It has a 5+2+2 Phases Digital VRM Solution and supports DDR5 memory with AMD EXPO & Intel XMP. It features Wi-Fi 6E and 2.5GbE LAN for blazing-fast network speeds, and a PCIe 4.0 x4 M.2 connector for super-speed storage. This is a great budget-to-mid-range option for gamers.","price":"129.99 JOD","thumbnail":"https://www.gigabyte.com/Motherboard/B650M-GAMING-PLUS-WIFI-rev-10-11-12","product_id":"MOBO-013","specs":{"Manufacturer":"Gigabyte","Series":"Gaming","Chipset":"AMD B650","Socket":"AM5","Form Factor":"Micro ATX","Memory":"DDR5","M.2 Slots":"2","Wi-Fi":"Wi-Fi 6E","LAN":"2.5GbE","VRM":"5+2+2 Phases Digital"}}}
{"pageContent":"This motherboard is optimized for AMD Ryzen X3D processors, delivering superior stability, compatibility, and enhanced performance. It features an optimized VRM design and is built on a 6-layer PCB. With PCIe Gen5 support and Wi-Fi 6E, it's a great mid-range option for a powerful build.","metadata":{"title":"ASRock B650M Pro RS WiFi","description":"The ASRock B650M Pro RS WiFi is built with stability, durability, and efficiency in mind. It features an 8+2+1 power phase design with Dr. MOS for smooth power delivery. It supports DDR5 memory up to 8000+(OC) and includes a Blazing M.2 PCIe Gen5x4 slot. With Wi-Fi 6E and a 2.5Gb/s LAN, this motherboard is perfect for gamers and creators.","price":"99.99 JOD","thumbnail":"https://www.asrock.com/MB/AMD/B650M%20Pro%20X3D%20WiFi/index.asp","product_id":"MOBO-014","specs":{"Manufacturer":"ASRock","Series":"Pro RS","Chipset":"AMD B650","Socket":"AM5","Form Factor":"Micro ATX","Memory":"DDR5","M.2 Slots":"3","Wi-Fi":"Wi-Fi 6E","LAN":"2.5G","Power Phases":"8+2+1"}}}
{"pageContent":"A premium gaming motherboard for AMD's Ryzen 7000 series processors. It offers cutting-edge power design, comprehensive cooling, and next-gen connectivity with PCIe 5.0 and Wi-Fi 6E. It is an ideal choice for enthusiasts and gamers who demand the best performance and features.","metadata":{"title":"Asus ROG STRIX B650E-F GAMING WIFI","description":"The ROG Strix B650E-F is a mean machine built for speed and expansion. It features a 12+2 power solution rated for 80A per stage, an 8-layer PCB, and a comprehensive cooling system with M.2 heatsinks. With a PCIe 5.0 x16 slot and two PCIe 4.0 M.2 slots, it's ready for future hardware. It also includes Wi-Fi 6E and 2.5GbE LAN for low-latency networking.","price":"189.99 JOD","thumbnail":"https://rog.asus.com/uk/motherboards/rog-strix/rog-strix-b650e-f-gaming-wifi-model/","product_id":"MOBO-015","specs":{"Manufacturer":"Asus","Series":"ROG Strix","Chipset":"AMD B650E","Socket":"AM5","Form Factor":"ATX","Memory":"DDR5","M.2 Slots":"3","Wi-Fi":"Wi-Fi 6E","LAN":"2.5GbE","Power Stages":"12+2"}}}
{"pageContent":"A high-end motherboard for AMD's Ryzen 9000, 8000, and 7000 Series Desktop Processors. It's a special edition motherboard that combines cutting-edge technology with a unique aesthetic. It is powered by AMD Ryzen™ 9000 Series processors and features a PCIe® 5.0 x16 slot, dual USB4® Type-C ports and WiFi 7.","metadata":{"title":"Asus ROG STRIX X870E-H GAMING WIFI","description":"The ROG Strix X870E-H GAMING WIFI7 is a special edition motherboard that offers a blend of top-tier performance and unique design. It's powered by a 16+2+1 power stage design, has two large VRM heatsinks, and includes a PCIe 5.0 x16 slot and four M.2 slots (two PCIe 5.0). It comes with dual USB4 Type-C ports, Wi-Fi 7, and 2.5GbE LAN, making it a high-end choice for enthusiasts.","price":"329.99 JOD","thumbnail":"https://rog.asus.com/motherboards/rog-strix/rog-strix-x870e-h-gaming-wifi7-hatsune-miku-edition/","product_id":"MOBO-016","specs":{"Manufacturer":"Asus","Series":"ROG Strix","Chipset":"AMD X870E","Socket":"AM5","Form Factor":"ATX","Memory":"DDR5","M.2 Slots":"4","Wi-Fi":"Wi-Fi 7","LAN":"2.5GbE","Power Stages":"16+2+1"}}}
{"pageContent":"A stunning motherboard with a silver-and-white finish and cyberpunk-inspired aesthetics. It is built to handle 3rd Gen AMD Ryzen™ CPUs with its robust power delivery and effective cooling. It supports PCIe 4.0 and is a great choice for a mid-to-high-end AM4 build.","metadata":{"title":"Asus ROG STRIX B550-A GAMING","description":"The ROG Strix B550-A Gaming motherboard offers robust power delivery and effective cooling to handle 3rd Gen AMD Ryzen™ CPUs. It features a 12+2 power stage design, ProCool power connector, and a 6-layer PCB. It's PCIe 4.0-ready with two M.2 slots and includes an M.2 heatsink. This motherboard is an excellent choice for a stylish and high-performance AM4 build.","price":"89.99 JOD","thumbnail":"https://rog.asus.com/us/motherboards/rog-strix/rog-strix-b550-a-gaming-model/","product_id":"MOBO-017","specs":{"Manufacturer":"Asus","Series":"ROG Strix","Chipset":"AMD B550","Socket":"AM4","Form Factor":"ATX","Memory":"DDR4","M.2 Slots":"2","LAN":"2.5GbE","Power Stages":"12+2"}}}
{"pageContent":"A classic motherboard for AMD's AM4 platform, offering a great balance of features and performance for gamers. It features a robust power design and an advanced thermal solution. With Lightning Gen 4 support and Wi-Fi 6E, it's a great choice for a high-performance AM4 build.","metadata":{"title":"MSI MAG B550 TOMAHAWK MAX WIFI","description":"The MSI MAG B550 TOMAHAWK MAX WIFI is a gaming motherboard that delivers a premium experience with its robust hardware design. It features an extended heatsink, M.2 Shield Frozr, and a 6-layer PCB with 2oz thickened copper for superior cooling and stability. With Lightning Gen 4 M.2 and PCIe support, Wi-Fi 6E, and 2.5G LAN, it's a reliable choice for a powerful AM4 gaming rig.","price":"89.99 JOD","thumbnail":"https://www.msi.com/Motherboard/MAG-B550-TOMAHAWK-MAX-WIFI","product_id":"MOBO-018","specs":{"Manufacturer":"MSI","Series":"MAG","Chipset":"AMD B550","Socket":"AM4","Form Factor":"ATX","Memory":"DDR4","M.2 Slots":"2","Wi-Fi":"Wi-Fi 6E","LAN":"2.5G","Power Phases":"10+2+1"}}}
{"pageContent":"A reliable and affordable micro-ATX motherboard for AMD's AM4 platform. It provides all the essential features for a professional workflow, with stable functionality and high-quality assembly. It's a great choice for a budget-friendly home or office PC.","metadata":{"title":"MSI B550M PRO-VDH WIFI","description":"The MSI B550M PRO-VDH WIFI is part of the PRO series, designed to help users work smarter. It features a Flash BIOS button, Audio Boost, and a 2oz thickened copper PCB for reliable performance. The M.2 Shield Frozr ensures your SSDs stay cool, and its Lightning Gen 4 PCIe and M.2 solutions provide fast transfer speeds. This is a great value-oriented board.","price":"69.99 JOD","thumbnail":"https://www.msi.com/Motherboard/B550M-PRO-VDH","product_id":"MOBO-019","specs":{"Manufacturer":"MSI","Series":"PRO","Chipset":"AMD B550","Socket":"AM4","Form Factor":"Micro ATX","Memory":"DDR4","M.2 Slots":"2","Wi-Fi":"Wi-Fi","LAN":"Gigabit LAN"}}}
{"pageContent":"An entry-level motherboard for AMD's AM4 platform, perfect for budget-conscious builders. It provides all the necessary features for a functional PC, including support for DDR4 memory and an Ultra M.2 slot for an SSD. Its reliable design and solid capacitors ensure long-term stability.","metadata":{"title":"ASRock B450M-HDV R4.0","description":"The ASRock B450M-HDV R4.0 is a micro-ATX motherboard that provides a solid foundation for a budget AMD build. It supports a wide range of AMD Ryzen processors and features a Solid Capacitor Design and Digi Power for stable operation. It supports DDR4 memory and includes an Ultra M.2 slot for an SSD. This is a reliable and affordable choice for a basic PC build.","price":"49.99 JOD","thumbnail":"https://www.asrock.com/mb/AMD/B450M-HDV%20R4.0/index.asp","product_id":"MOBO-020","specs":{"Manufacturer":"ASRock","Series":"HDV","Chipset":"AMD B450","Socket":"AM4","Form Factor":"Micro ATX","Memory":"DDR4","M.2 Slots":"1","LAN":"Gigabit LAN"}}}
